src/InformationRegisters/ПроизводительностьПлатформы/ПроизводительностьПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводительностьПлатформы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>N_T</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>N_T_4T</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВремениВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПрофильКлючевыхОпераций</name>
    <type>
      <types>CatalogRef.ПрофилиКлючевыхОпераций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформыЦентрМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнформационнойБазы</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимРаботыКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РелизнаяВерсияКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиРасчетаПроизводительностиПлатформы/НастройкиРасчетаПроизводительностиПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиРасчетаПроизводительностиПлатформы</name>
  <resources>
    <name>РассчитанПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГлубинаРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПрофильКлючевыхОпераций</name>
    <type>
      <types>CatalogRef.ПрофилиКлючевыхОпераций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИнформацияИсторияПодробно/ИнформацияИсторияПодробно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияИсторияПодробно</name>
  <resources>
    <name>КоличествоПользователей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>CatalogRef.ВерсииОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлатформы</name>
    <type>
      <types>CatalogRef.ТипыПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимРаботыКонфигурации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>CatalogRef.ВерсииКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформыЦентрМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РезультатАнализаИнформационныхБаз/РезультатАнализаИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатАнализаИнформационныхБаз</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПроведенияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСтатус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗамерыВремениЦентрМониторинга/ЗамерыВремениЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыВремениЦентрМониторинга</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючеваяОперация</name>
    <type>
      <types>CatalogRef.КлючевыеОперацииЦентрМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПакетЦентраМониторинга</name>
    <type>
      <types>DocumentRef.ПакетЦентраМониторинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/РежимРаботыКонфигурации/РежимРаботыКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимРаботыКонфигурации</name>
  <enumValues>
    <name>F</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПрофилиКлючевыхОпераций/ПрофилиКлючевыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиКлючевыхОпераций</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ПреобразоватьИмя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеОперацииПрофиля</name>
    <attributes>
      <name>КлючеваяОперация</name>
      <type>
        <types>CatalogRef.КлючевыеОперацииЦентрМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевоеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Важность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоиск</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличествоЗамеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПроизводительностьПлатформы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура РассчитатьПроизводительностьПлатформыПоПрофилю(ПрофильКлючевыхОпераций) Экспорт
	
	// 1. Получить дату, по которую рассчитан профиль.
	// 2. Определить период расчета.
	// 3. Повторять действия, пока дата окончания расчета меньше текущей даты.
	// 4. Получить и проанализировать данные.
	// 5. Записать данные в регистр.
	// 6. Определить период расчета.
	
	ТекущаяДата = НачалоДня(ТекущаяДата());
	
	// 1. Получить дату, по которую рассчитан профиль.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиРасчетаПроизводительностиПлатформы.ПрофильКлючевыхОпераций КАК ПрофильКлючевыхОпераций,
	                      |	НастройкиРасчетаПроизводительностиПлатформы.РассчитанПо КАК РассчитанПо,
	                      |	НастройкиРасчетаПроизводительностиПлатформы.ГлубинаРасчета КАК ГлубинаРасчета
	                      |ИЗ
	                      |	РегистрСведений.НастройкиРасчетаПроизводительностиПлатформы КАК НастройкиРасчетаПроизводительностиПлатформы
	                      |ГДЕ
	                      |	НастройкиРасчетаПроизводительностиПлатформы.ПрофильКлючевыхОпераций = &ПрофильКлючевыхОпераций");
	Запрос.УстановитьПараметр("ПрофильКлючевыхОпераций", ПрофильКлючевыхОпераций);
	ВыборкаНастройка = Запрос.Выполнить().Выбрать();
	Если Не ВыборкаНастройка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	РассчитанПо = ВыборкаНастройка.РассчитанПо;
	ГлубинаРасчета = ВыборкаНастройка.ГлубинаРасчета;
	Если ВыборкаНастройка.РассчитанПо >= ТекущаяДата Тогда
		Возврат;
	КонецЕсли;
			
	// 2. Определить период расчета.
	ПериодРасчета = ПериодРасчета(РассчитанПо, ГлубинаРасчета);
	ПустаяВерсия = Справочники.ВерсииПлатформыЦентрМониторинга.НайтиПоНаименованию("0.0.0.0", Истина);
	РежимыРаботыКонфигурации = Новый Массив;
    РежимыРаботыКонфигурации.Добавить(Перечисления.РежимРаботыКонфигурации.F);
    РежимыРаботыКонфигурации.Добавить(Перечисления.РежимРаботыКонфигурации.S);
	// 3. Повторять действия, пока дата окончания расчета меньше текущей даты.
	
	Запрос = Новый Запрос;
    МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;       
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    Справочники.ПрофилиКлючевыхОпераций.ДобавитьВременнуюТаблицуКлючевыхОпераций(ПрофильКлючевыхОпераций, Запрос, "КлючевыеОперации");	
	Запрос.Выполнить();
	
	Пока ПериодРасчета.ДатаОкончания < ТекущаяДата Цикл  
		// 4. Получить и проанализировать данные.
		Запрос.Текст = ТекстЗапросаАнализа(ПериодРасчета.ДатаНачала, ПериодРасчета.ДатаОкончания);
		Запрос.УстановитьПараметр("ДатаНачала", ПериодРасчета.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодРасчета.ДатаОкончания);
		Запрос.УстановитьПараметр("ПустаяВерсия", ПустаяВерсия);
		Запрос.УстановитьПараметр("РежимыРаботыКонфигурации", РежимыРаботыКонфигурации); 
		
		ВыборкаПоПериоду = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоПериоду.Следующий() Цикл
			// 5. Очистим данные по профилю в разрезе даты.
			НаборЗаписей = РегистрыСведений.ПроизводительностьПлатформы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ВыборкаПоПериоду.Период);
			НаборЗаписей.Отбор.ПрофильКлючевыхОпераций.Установить(ПрофильКлючевыхОпераций);
			НаборЗаписей.Записать();
			// 6. Записать данные в регистр и в настройки.
			Выборка = ВыборкаПоПериоду.Выбрать();
			Пока Выборка.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.ПроизводительностьПлатформы.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.ПрофильКлючевыхОпераций.Установить(ПрофильКлючевыхОпераций);
				НаборЗаписей.Отбор.ВерсияПлатформы.Установить(Выборка.ВерсияПлатформы);
				НаборЗаписей.Отбор.СтатусИнформационнойБазы.Установить(Выборка.СтатусИнформационнойБазы);
				НаборЗаписей.Отбор.РелизнаяВерсияКонфигурации.Установить(Выборка.РелизнаяВерсияКонфигурации);
				НаборЗаписей.Отбор.РежимРаботыКонфигурации.Установить(Выборка.РежимРаботыКонфигурации);
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.ПрофильКлючевыхОпераций = ПрофильКлючевыхОпераций;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЦикла;
		
		
		// 7. Определить период расчета.
	    РассчитанПо = РассчитанПо + ГлубинаРасчета * 86400;
	 	ПериодРасчета = ПериодРасчета(РассчитанПо, ГлубинаРасчета);
		
		ЗаписьНастройки = РегистрыСведений.НастройкиРасчетаПроизводительностиПлатформы.СоздатьМенеджерЗаписи();
		ЗаписьНастройки.ПрофильКлючевыхОпераций = ПрофильКлючевыхОпераций;
		ЗаписьНастройки.Прочитать();
		ЗаписьНастройки.РассчитанПо = ?(РассчитанПо > ТекущаяДата, ТекущаяДата, РассчитанПо);
		ЗаписьНастройки.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПериодРасчета(РассчитанПо, ГлубинаРасчета)
	ДатаОкончания = НачалоДня(РассчитанПо)-1;
	ДатаНачала = НачалоДня(РассчитанПо - ГлубинаРасчета * 86400);
	Возврат Новый Структура("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания);
КонецФункции

Функция ТекстЗапросаАнализа(ДатаНачала, ДатаОкончания)
	ТекстЗапроса = Общий.ТекстЗапросаПериодов(ДатаНачала, ДатаОкончания, "День");
    ТекстЗапроса = ТекстЗапроса + ";
			|ВЫБРАТЬ
			|	Периоды.Период КАК Период,
			|	История.ВерсияПлатформы КАК ВерсияПлатформы,
			|	История.РежимРаботыКонфигурации КАК РежимРаботыКонфигурации,
			|	История.ВерсияКонфигурации.Релизная КАК РелизнаяВерсияКонфигурации,
			|	ЕСТЬNULL(РезультатАнализаИнформационныхБаз.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИнформационнойБазы.ПустаяССылка)) КАК СтатусИнформационнойБазы,
			|	История.ИнформационнаяБаза КАК ИнформационнаяБаза
			|ПОМЕСТИТЬ ВТ_ИБ
			|ИЗ
			|	Периоды КАК Периоды
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияИсторияПодробно КАК История
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезультатАнализаИнформационныхБаз КАК РезультатАнализаИнформационныхБаз
			|			ПО История.ИнформационнаяБаза = РезультатАнализаИнформационныхБаз.ИнформационнаяБаза
			|		ПО (История.ПериодЗаписи = Периоды.Период)
			|			И (История.РежимРаботыКонфигурации В (&РежимыРаботыКонфигурации))
			|			И (История.ВерсияПлатформы <> &ПустаяВерсия)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Периоды.Период,
			|	История.ИнформационнаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ Периоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИнформационныеБазы.Период КАК Период,
			|	ИнформационныеБазы.ВерсияПлатформы КАК ВерсияПлатформы,
			|	ИнформационныеБазы.РежимРаботыКонфигурации КАК РежимРаботыКонфигурации,
			|	СУММА(ВЫБОР
			|			КОГДА Замеры.ВремяВыполнения <= ЕСТЬNULL(Профиль.ЦелевоеВремя, 1)
			|				ТОГДА Замеры.КоличествоОпераций
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК N_T,
			|	СУММА(ВЫБОР
			|			КОГДА Замеры.ВремяВыполнения > ЕСТЬNULL(Профиль.ЦелевоеВремя, 1)
			|					И Замеры.ВремяВыполнения <= ЕСТЬNULL(Профиль.ЦелевоеВремя, 1) * 4
			|				ТОГДА Замеры.КоличествоОпераций
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК N_T_4T,
			|	СУММА(Замеры.КоличествоОпераций) КАК КоличествоОпераций,
			|	СУММА(Замеры.ВремяВыполнения * Замеры.КоличествоОпераций) КАК СуммаВремениВыполнения,
			|	ИнформационныеБазы.СтатусИнформационнойБазы КАК СтатусИнформационнойБазы,
			|	ИнформационныеБазы.РелизнаяВерсияКонфигурации КАК РелизнаяВерсияКонфигурации
			|ИЗ
			|	ВТ_ИБ КАК ИнформационныеБазы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗамерыВремениЦентрМониторинга КАК Замеры
			|		ПО (Замеры.Период = ИнформационныеБазы.Период)
			|			И (Замеры.ИнформационнаяБаза = ИнформационныеБазы.ИнформационнаяБаза)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлючевыеОперации КАК Профиль
			|		ПО (Профиль.КлючеваяОперация = Замеры.КлючеваяОперация)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИнформационныеБазы.ВерсияПлатформы,
			|	ИнформационныеБазы.РежимРаботыКонфигурации,
			|	ИнформационныеБазы.Период,
			|	ИнформационныеБазы.СтатусИнформационнойБазы,
			|	ИнформационныеБазы.РелизнаяВерсияКонфигурации
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период
			|ИТОГИ ПО
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТ_ИБ";
	Возврат ТекстЗапроса;
КонецФункции

#КонецЕсли
